{
  "segments": [
    {
      "start": 2.63,
      "end": 30.878,
      "text": " So we'd drag it into the middle of her bridge party or her D.A.R. ladies luncheon or whatever and she'd just go berserk. And then he decided that he was going, he thought armadillos were really strange creatures. And he was of the mind that, you know, everything could be eaten, squirrels, rabbits, so we needed to eat an armadillo."
    },
    {
      "start": 31.722,
      "end": 60.477,
      "text": " And so, I don't know where we were. I may have been at tutoring or I don't know. But we came home one day and he was the only one who was home. And the picnic table was covered with blood. And he had caught an armadillo and killed it and then de-shelled it and put it, taken it into the kitchen and put it into"
    },
    {
      "start": 62.063,
      "end": 86.954,
      "text": " big old roasting pan and put all this garbage on it and stuck it in the oven for our dinner that night he was gonna try an armadillo yeah he was he was gonna try an armadillo overall that's what they used to call him right and then he was very brave i learned to drive with him and this was when he was late 70s"
    },
    {
      "start": 88.675,
      "end": 118.662,
      "text": " And I'd run into ditches, and he just wouldn't say a whole lot. He was a neat guy. So you were very fortunate from a standpoint, because you grew up with kind of an extended family around you then, didn't you? Yeah. I think that's what a lot of people miss today. Yes, I think so, too. And I think they miss a lot of values as a result of a lot of that. I do, too. I grew up the same way, with an extended family"
    },
    {
      "start": 119.168,
      "end": 142.743,
      "text": " There's 14 in my mother's family, and they were together constantly, all the time. Almost every Sunday there was a group of them together. And then on my dad's side, it was the same way. There was a group of them that were together. So we're one of the two places where both sides were there at the house all the time. It was a lot of fun going. And now no one has time for anybody. That's the problem. Yeah, that's right."
    },
    {
      "start": 143.317,
      "end": 155.804,
      "text": " I mean it was a big deal then to make ice cream on Saturday night. I mean they'd come far and wide to eat ice cream and shoot the bull and play dominoes. Right."
    }
  ]
}