{
  "segments": [
    {
      "start": 7.456,
      "end": 36.008,
      "text": " The big student organizations when you were here, the big student organizations, the band, what else were notable? Had the Royal Volunteers and the band. The only thing I recall that we had other than cadet units. The student leaders that everyone respected and admired, Corps Commander, who else?"
    },
    {
      "start": 37.173,
      "end": 60.224,
      "text": " Well, regimental commanders were highly respected. General Ray Murray was my senior regimental commander. I was on his staff, and most of the Marine generals that we had, we had four or five, had prominent"
    },
    {
      "start": 61.54,
      "end": 88.152,
      "text": " jobs. The cadet colonel was, went direct to the Marines, but never did get past the promotion, past the full colonel. But the other four of my class were two-star generals. Mayor General Holtmuth was killed in a"
    },
    {
      "start": 89.958,
      "end": 110.832,
      "text": " air crash in Vietnam. There wasn't even a student body president then in those days, was there? He had a president of each class. That's what I thought. But if you could have had any student leadership position on the campus, would the highest prestige have gone to the corps commander?"
    },
    {
      "start": 112.368,
      "end": 139.317,
      "text": " Well, the opinion of most cadets during my day, your highest job as far as prestige was being a unit commander. Oh, okay. Now, whether a guy had a choice of being a unit commander or a corps commander, it might vary with the individual, but that was the"
    },
    {
      "start": 140.38,
      "end": 157.373,
      "text": " That was everybody's ambition, to be the unit commander. We had a young fellow that was our senior cadet commander that was born and raised in"
    },
    {
      "start": 158.757,
      "end": 176.915,
      "text": " 80 miles south of Douglas, Arizona in Mexico, where his dad was a superintendent of a copper mine. And he was educated in Douglas, Arizona. I visited with him one summer."
    },
    {
      "start": 176.915,
      "end": 192.777,
      "text": " He was our senior cadet commander and was killed in an airplane crash and was not in the service, but he was with the U.S. Department of Agriculture Hoof and Mouth Program."
    },
    {
      "start": 193.942,
      "end": 222.612,
      "text": " And he and his roommate roomed together four years, and they're the only two people I knew that lived together four years. And they met in a depot in Houston. One comes from Douglas, Arizona, and the other one comes from Louisiana. And they met in Houston to catch a train coming up here. They said since both of us are foreigners, let's room together and stay together four years."
    },
    {
      "start": 222.612,
      "end": 237.8,
      "text": " And we're still real close to the family from Louisiana because they were in the rice business, and they're both gone. Their daughter and granddaughter were here about three weeks ago, spent the weekend with us. Did you ever hitchhike?"
    },
    {
      "start": 239.369,
      "end": 253.325,
      "text": " Very little. Didn't hitchhike much because they didn't have anywhere to go because it's too far to hitchhike back to Crockett because until they built the first river bridge about the beginning of my senior year,"
    },
    {
      "start": 254.945,
      "end": 282.653,
      "text": " it wasn't good to hitchhike toward the ferry. You had to go from here to Rowan's Prairie and Huntsville and Riverside and Trinity to hitchhike, see, to go around. In fact, on several occasions, when that river, you could not cross the ferry boat, that's the way I had to go home. Didn't go home but twice a year, usually. Sometimes I'd go home on the"
    },
    {
      "start": 283.227,
      "end": 307.983,
      "text": " RV holidays. It's entirely different now from what it was then. Can you describe a court trip during your undergraduate days? Yes, we had two court trips my freshman year. I think the official one was to Shreveport, Louisiana. We were playing centenary, and I believe"
    },
    {
      "start": 307.983,
      "end": 334.105,
      "text": " That was the official court trip, and I think there was enough people in one year, in my freshman year, that we had an unofficial to the Thanksgiving game in Austin, and even paraded, and it was not recognized as an official trip. In fact, I have a picture somewhere. How did you get to Austin?"
    },
    {
      "start": 334.358,
      "end": 364.295,
      "text": " Probably cars. So you crowded in? And some hitchhiking. All right. To Shreveport, do you remember how you got there? On a train. They run a special train. Where'd you spend the night? On the train. Oh, on the train. Spent the night on the train going and on the night coming back. All right. In your other three years, court trips to Dallas or Fort Worth, were there any Tessies that came to the game? Any girls from TSCW?"
    },
    {
      "start": 364.7,
      "end": 386.452,
      "text": " Yes, there was a few acquaintances every year from TCU and SMU, TSCW, but not as full scale as it is now. Now, the fact that you were a student here, did that help you to meet this young lady?"
    },
    {
      "start": 387.802,
      "end": 410.566,
      "text": " Well, I met her on a blind date because a gentleman worked at the post office with Tiger Teague that was her brother-in-law. No, Tiger Teague and Robert worked together. Yeah, but he was married to your sister."
    },
    {
      "start": 412.034,
      "end": 438.933,
      "text": " Freddie Teague and my sister were just like that. I see. And I came to visit my sister here. During the summer when I was trying to catch up with my lost scalpels. And we went on a picnic, the Brightest River, and that's how we met. Now, she mentioned going on a picnic. Where did you students go for a good time?"
    },
    {
      "start": 439.186,
      "end": 465.663,
      "text": " While you were undergraduate? I don't recall any place. Now, wait. Don't tell me y'all never went out on a Saturday night. Well, now, there were a few that were addicted to hard liquors. I say a few. There wasn't as many as there would be now. Now, describe that. It was located on the Welborn Road about where? About where Holloman Street comes out."
    },
    {
      "start": 466.355,
      "end": 492.646,
      "text": " And Mr. Hardlicker is H-Y-R-D... I'm not sure. I presume it's a Czech name. Yeah. And he served beer legally. Legally. And was that, he didn't serve whiskey, did he? No. And did they also have food? Could you get a hamburger or a hot dog? I think they had a little miscellaneous food. Probably would have seated how many?"
    },
    {
      "start": 493.827,
      "end": 513.149,
      "text": " Oh, probably 25 or 30 at a time. But if it was a Saturday night and things were loose enough, half of them were outside. But I was never one of their patrons. In your day, did students also go to what later would be called Whiskey Bridge?"
    },
    {
      "start": 514.246,
      "end": 536.892,
      "text": " No, a few people that had cars might have gone out there, but I don't know whether Whiskey Bridge was there when I was a student. I believe that was after my time. What was there in Bryan that a student would go to enjoy? Movies. Movies was about the only thing. And a rare date."
    },
    {
      "start": 538.563,
      "end": 560.838,
      "text": " And we had this trolley run from about where the Capitol into Bryan. Ran maybe every 30 minutes. Did it run along parallel to the railroad? Remember what it cost? No."
    },
    {
      "start": 561.327,
      "end": 590.47,
      "text": " Very, very nominal. And people would go over the weekend probably to see a movie and a few were fortunate enough to have dates. Queen Theater and the Palace were the two of the big ones in those days. Was there a place, let's make believe that you had a date and you wanted to go eat at a fancy place. Where would that have been? I don't recall any at this time."
    },
    {
      "start": 592.327,
      "end": 604.831,
      "text": " I'm not gonna say there wasn't any, but I didn't have that occasion. The project houses that Dan Russell had helped create, they were in full"
    },
    {
      "start": 605.877,
      "end": 634.447,
      "text": " No, that was after my time. Is that right? Now, the students from Houston County had their own project house where I left my car for a while. But that wasn't on the campus. I don't believe the project house was built when I was here as a student. It was soon after that. And I knew Dan Russell very, very well because he was born and raised in my county."
    },
    {
      "start": 635.78,
      "end": 658.78,
      "text": " Talk about him a minute. Describe him. We don't have anything yet in the file about Dan Russell. Well, he was a fine Christian gentleman and would help anybody any way he could. In fact, I expect he passed more people in real sociology that didn't deserve a passing grade than the ones he passed legally."
    },
    {
      "start": 658.78,
      "end": 674.474,
      "text": " Because am I correct that his nickname was Dr. Dan the Grade Point Man? Grade Point Man was his nickname, but he was a great gentleman. Why did he grade, why did he not flunk more? Why did he grade easy? I feel like at"
    },
    {
      "start": 675.892,
      "end": 703.482,
      "text": " He knew that most of their courses were very difficult, and if they could listen to his lectures for a semester, that they got enough out of the course to get a passing grade. That's the best answer I can give you. But he was a great gentleman. But the project house was a project of his. All right, then the residential area."
    },
    {
      "start": 704.393,
      "end": 734.144,
      "text": " south of the campus was still quite small? Well, it would be probably from George Bush Drive to Park Place would be about it. Herschel Burgess developed most of that. And many, many of the faculty and staff lived on campus. That's right. And I understand from Rusty and"
    },
    {
      "start": 736.304,
      "end": 761.296,
      "text": " Henry Gilchrist, that the A&M consolidated schools all did their instruction on campus until I believe 1937. I don't know when the change was made, but the high school was across the street from a confectionery called George McCullough's, about where Dormitory 2 is now."
    },
    {
      "start": 762.224,
      "end": 783.689,
      "text": " That was the high school. In fact, they taught some classes in old Pfeiffer Hall. Now, you college students didn't have any interaction with the high school students much at all. No. Now, would it have been acceptable for an Aggie undergraduate to have dated a named and consolidated girl?"
    },
    {
      "start": 784.178,
      "end": 805.897,
      "text": " I think it had been left up to her parents. Oh, okay. Y'all wouldn't have made fun of him if he did. No, I don't think so. No, they were short of space over there, and Pfeiffer Hall had been condemned. And the engineers went there and put some rods about three-quarters of an inch"
    },
    {
      "start": 805.897,
      "end": 831.985,
      "text": " on two horizontal and four crossways with flanges on the outside and made it safe. And they had classes in there, I think, until they built their first high school. In fact, I've helped a number of sessions on early school history and early residential"
    },
    {
      "start": 831.985,
      "end": 861.702,
      "text": " here for the city college station. They're trying to put a book together on the whole thing. In fact, I carried a piece of one of those dials, one of those rods up to one of the meetings and told them what it was for, but there was nobody in the group that could spell Pfeiffer. P-F, I think it is, isn't it? I don't remember. I think it's P-F-E-I-F-F, I believe, but I'm not sure. Now, the Depression was in full swing"
    },
    {
      "start": 862.698,
      "end": 892.094,
      "text": " by the time you were getting out of school, what did you think you were going to be doing with the rest of your life when you left, when you got ready to leave A&M? Well, my classroom work qualified me as a teacher of vocational subjects. And I thought if I could mix that with a coaching job that I'd be working with people and do a lot of good. And I got my first job"
    },
    {
      "start": 892.955,
      "end": 900.869,
      "text": " During the RV holidays, the president of the A&M band was a friend of mine."
    },
    {
      "start": 902.472,
      "end": 926.485,
      "text": " And he lived in Luling, Texas, and he said, you got a job yet? And I said, no. He said, my school, high school's got an opening, and my mother's on the school board. Why don't you take your RV holidays and go home with me? So I did, and got my first job at Luling."
    },
    {
      "start": 926.924,
      "end": 938.534,
      "text": " They did not have a shop, but they were in the process of trying to put in a shop. They did not have a basketball team, but I had a full-time assignment three times a week officiating basketball."
    },
    {
      "start": 939.209,
      "end": 963.948,
      "text": " from the nearby town. And when the superintendent and principal interviewed me for the job, they said, what are you qualified to teach? And I said, I've got chemistry, I've got a minor in chemistry, and my major is vocational work. But if you give me a book and a weak start, I'll teach anything in the building. And I think that's what hired me."
    },
    {
      "start": 964.555,
      "end": 974.258,
      "text": " So you did get hired at Luling. Yeah, hired at Luling. Do you remember what the salary was? I believe it was $250 a month."
    },
    {
      "start": 975.288,
      "end": 1004.009,
      "text": " Because I left there after one year to go to Isleta. It's now in the El Paso District. And it was a much better job, and I was assured a basketball coaching job. But the best story about my job was probably the one I got here, which you probably want to tie that to you."
    },
    {
      "start": 1004.009,
      "end": 1030.233,
      "text": " my staff job, how I got it. Yeah, let's hold on to that a second. Hold on, next time. Let's see, back to student days, did students try to smuggle alcohol into the dormitory in those days? I don't recall it. All right, what about smoking? Who smoked? I don't think there's any borderline on smoking. I don't remember. Did the average student smoke? No."
    },
    {
      "start": 1031.347,
      "end": 1046.45,
      "text": " I don't believe that every student smoked. But students were allowed to smoke in their room if they wanted to? I think so. They probably couldn't afford it. If you didn't like smoke, just don't visit them. What about chewing tobacco?"
    },
    {
      "start": 1047.631,
      "end": 1069.383,
      "text": " Did students chew? The only thing I remember about chewing tobacco is it made all the freshman band members chew tobacco at the first baseball game. Have you heard that? No. They'd go to the first part of the baseball game, and every freshman in the band had to chew tobacco, dip snuff."
    },
    {
      "start": 1069.383,
      "end": 1098.425,
      "text": " And there were about 95% of them sick when the game was over. But that was for the first varsity baseball game. Nothing but band. Nobody else did it. Let's see. Describe for a typical undergraduate at A&M then, describe a typical football game day, what happened for you for a home football game."
    },
    {
      "start": 1099.437,
      "end": 1126.994,
      "text": " I don't ever remember of a march in. If we had a march in, I don't remember. Really? Now maybe they did. Maybe being an athlete I might have been excused because I might not have been able to stay in step. But you did sit on the east side. Yeah. I mean stand, excuse me, stand. Yeah. And the lower level is all we had. And y'all did kiss your dates. Yeah."
    },
    {
      "start": 1127.213,
      "end": 1156.441,
      "text": " And did the yell leaders dress then about like they do now? I think so. And the yells had signals? Yells had signals and no megaphones. And about the only thing I recall ever forming was a blocked T. I don't think there's any other formation ever attempted. What about some of the ritual events? Did you help with bonfire?"
    },
    {
      "start": 1157.538,
      "end": 1178.48,
      "text": " Yes, bonfires were all together different. Bonfire in my day was a cleanup for Brazos County. They would call in the Commandant's Office if somebody had an old wooden building to tear down or something that would burn. And in most cases, there was not a green log on it."
    },
    {
      "start": 1179.273,
      "end": 1208.078,
      "text": " Were there some logs at all? If there were, they were probably dead and hauled in with this other stuff. But people knew that, and they'd call in, take the calls at the communist office, and they'd go out and get the stuff and had probably as big a fire, but not as hot and not as long and not as high. Was it on the drill field? Yeah. Was there a privy usually on top of it? Yeah."
    },
    {
      "start": 1209.057,
      "end": 1236.901,
      "text": " And that, quite often, was a real privy, wasn't it? Yeah, and got somebody in trouble. That's the reason they started making them. Did you all do silver taps? Yeah. Where was it held? It was held at Soros Monument, with the buglers on the top of the academic building. Do you remember your feelings when you went to your first silver taps, or any of the other? No."
    },
    {
      "start": 1238.622,
      "end": 1264.542,
      "text": " I don't believe it would be any different than it would now, but it was different. Do you remember any time going to Silver Taps for a close friend while you were a student? No, I don't believe I do. But it still meant the same. Was there muster in those days? Aggie muster? I believe so. Do you remember where it was held? No, I don't remember where it was held."
    },
    {
      "start": 1265.285,
      "end": 1281.974,
      "text": " Do you remember Final Review? Yeah. Final Review is about the same as it is now. We're changing command and going around twice, and most of the seniors"
    },
    {
      "start": 1283.24,
      "end": 1312.99,
      "text": " had their next year's gear in Long Prairie Hall, and that's as far as they had to go to change it. So I remember that, remember them well, especially my last one, because I went from final review to active duty the next morning at Fort Sam Houston. I had asked for two weeks tour to get that out of the way before I got a job."
    },
    {
      "start": 1312.99,
      "end": 1327.773,
      "text": " Then my correspondence after two years, he could be a first lieutenant. By doing that, I was a first lieutenant when I was called before Pearl Harbor. By virtue of getting that first"
    },
    {
      "start": 1328.937,
      "end": 1349.812,
      "text": " military assignment, which is something they don't have anymore, CMTC, Citizen Military Training Camp, out at Bullis, where I had been the summer before for junior camp, went to Bullis. Now, I'm assuming that when you were an undergraduate, you and your buddies did not expect"
    },
    {
      "start": 1351.482,
      "end": 1374.145,
      "text": " something like World War II, that that was... No. That was the least of anybody's mind. And the Depression, I presume, was the big concern and worry. Well, because I was here in school during part of the Depression. We have even a lot of our graduates have never given more than $15, $20, $30 during their lifetime."
    },
    {
      "start": 1376.693,
      "end": 1401.668,
      "text": " I'm not supposed to know that, but every silver-taps notice I get shows the total amount that they donated to A&M since they graduated, and it's alarming, because it was during the Depression, and a lot of people didn't even join the association at the minimum low."
    },
    {
      "start": 1404.048,
      "end": 1426.492,
      "text": " How much did, do you remember how much your ring cost? No, I don't remember. It wasn't much. I still have somewhere, it might be in my annual, I still have a receipt for my ring. I'm telling you it's a far cry from what it is now. Do you have any ring stories to share? Did you ever lose it or? No. Nothing like that?"
    },
    {
      "start": 1427.217,
      "end": 1445.729,
      "text": " No, the only ring story I could tell would be something that happened at the Iwo Jima, if you'd like me to tell you. Oh, yes. I helped organize the Aggie muster on Iwo Jima because things had settled down enough. Must be 45."
    },
    {
      "start": 1445.813,
      "end": 1471.582,
      "text": " Yeah, that we were just mopping up and cleaning up behind the Marines, and I was with a regimental combat team. And there was a Navy commander there in charge of all the construction people, a 27 A&M graduate. And he's the only person that had a dining hall big enough to get 40 people in."
    },
    {
      "start": 1472.459,
      "end": 1502.159,
      "text": " We didn't have 40 for mustard, but every Aggie except two, and they were on fighter duty that night, mustered in his dining hall. And before the eating meals started, his dining hall was about 150 yards from the coast. And everybody was changing vids and stories. A lot of people we'd never even met."
    },
    {
      "start": 1503.003,
      "end": 1524.316,
      "text": " on a sandbar out close to the water, probably 25 or 30 of us. And we noticed a destroyer come over the hump, a small boat. It might have been something smaller than a destroyer. And they had sunk some small boats in the form of a U, trying to make a little harbor."
    },
    {
      "start": 1525.48,
      "end": 1544.785,
      "text": " and the tugboat or whatever it was, I believe it was a tugboat, come up close enough that a man jumped off of the tugboat up on these boats that they salvaged in the water and come out right in front of us."
    },
    {
      "start": 1544.785,
      "end": 1572.072,
      "text": " I think we had a little A&M flag stuck in the sand. And he said, is this an A&M gathering? And I said, yes. And he said, well, I'm sure glad to see civilization, especially Aggie. He had on his Aggie ring, and he parachuted into the Gulf from a plane the night before, and his tugboat had picked him up."
    },
    {
      "start": 1572.072,
      "end": 1601.165,
      "text": " And then you can talk about one proud person. And I'm sorry I didn't follow up on the story, because it would have been a good story for Cooper if I could have remembered who he was. But I have the original roster of everybody that was at that muster. I kind of have the impression now that World War II made muster more important as an Aggie tradition than it actually was."
    },
    {
      "start": 1601.536,
      "end": 1628.114,
      "text": " Absolutely. Because now it certainly is a key. As you were getting ready to leave the campus, what kind of world did you think you were going to be entering, working in? Well, I had this job at Luling as a teacher, but not coaching because they didn't have a basketball team."
    },
    {
      "start": 1629.143,
      "end": 1642.93,
      "text": " I could see myself as a high school teacher, but I didn't know whether they were beyond Luling or not, and I just stayed there a year. Did you feel that A&M had prepared you pretty well?"
    },
    {
      "start": 1642.981,
      "end": 1666.842,
      "text": " I sure did. I felt like, and I've so stated that in an article in the June, Texas Aggie, have you read that story? Yes, sir. I just felt like I needed to give something back for the future. And I had this property and it was put together"
    },
    {
      "start": 1666.842,
      "end": 1693.387,
      "text": " and willed to me by a World War I Navy veteran, and I have a cadet scholarship coming up for him, and I have a Dairy Science scholarship coming up in memory of my brother, because he was a Dairy Science student and was on the National Jerry Judging Team his senior year. And the rest of my A&M's half of the money goes to Opportunity Award Scholarship."
    },
    {
      "start": 1694.095,
      "end": 1709.097,
      "text": " the Consolidated School, because both of my children are over there, and my high school in Crockett, and hers in McClellan County in Moody. And any others that can be added will"
    },
    {
      "start": 1709.097,
      "end": 1737.245,
      "text": " go back to here, maybe a rural school. We've got four rural high schools in Houston County. But that's pretty well. And I went to my church with the understanding that the doors would all be wide open in the future. I didn't know whether you'd seen that story or not. Yes, sir. What key qualities do you think A&M"
    },
    {
      "start": 1738.882,
      "end": 1768.852,
      "text": " put into you. What is it that Aggies learn, develop? If they didn't learn it, they should have. Whatever you do, do it well, or a little better. And appreciate everything that you do for yourself and your fellow man, and everything they do for you. Be friendly, make friends, and contribute to your community."
    },
    {
      "start": 1768.852,
      "end": 1792.763,
      "text": " And I think athletics helped me, and my military training here helped me more toward that goal. What are the events in an undergraduate Aggies experience that helps to create this spirit?"
    },
    {
      "start": 1793.573,
      "end": 1817.89,
      "text": " I think hometown clubs and clubs for your major. See, we had a Houston County A&M club. We had an industrial arts club. The Tea Association was a very, very active club. And the students now don't care much about the Tea Association. We can't even get it started."
    },
    {
      "start": 1818.751,
      "end": 1844.722,
      "text": " But RVs was a respected organization, but their routine now is entirely different from what it was when we got RV holidays before because it was something you wouldn't be proud of."
    },
    {
      "start": 1844.722,
      "end": 1862.592,
      "text": " the way they spent their three days in the early 30s, if you understand what I mean. But what about such activities as bonfire and taps and midnight yell practice? Are those important?"
    },
    {
      "start": 1863.031,
      "end": 1889.913,
      "text": " Yes, I think they're all important because it gives you unity. And I think community projects, cleaning up Brazos County from river to river and building the bonfire, I think means more to the community then than it does now. Because everybody saved their old lumber, old buildings, and it was just, it didn't"
    }
  ]
}