{
  "segments": [
    {
      "start": 2.022,
      "end": 23.926,
      "text": " I think it was on Channel 25, and I doubt if they even had a center pole that was very long, but it did have a real privy on top of it somewhere. Am I correct that one of the key parts of A&M Spirit is being inclusive of everybody"
    },
    {
      "start": 24.787,
      "end": 47.787,
      "text": " That's, at a, to draw the whole group together. Yeah, well it's just, I think athletic events had a lot to do with that and the selection of core leaders from one year to the next meant a lot. Do you remember your senior final review and commencement?"
    },
    {
      "start": 49.542,
      "end": 71.868,
      "text": " I don't remember much about my commencement, but I do remember my final review. I don't even remember where the commencement was. I remember my commissioning exercises. Where were they held? Guyon? I think it was in Guyon Hall. Were there any celebrities that came to visit A&M while you were an undergraduate?"
    },
    {
      "start": 75.563,
      "end": 99.037,
      "text": " It seemed to me like one of the presidents came for a short visit, but I don't remember who it was. But no movie stars? No, not that I can recall. And the big bands weren't coming through yet, were they? No. We didn't have anything like that, Opus. And the MSC was a great blessing when it was built."
    },
    {
      "start": 100.96,
      "end": 129.8,
      "text": " Alright, so now let's move forward. You go away and teach, World War II comes, and then you come back here as a member of the professional staff in 1945. Describe how that came about, please. Well, we'll get there. In other words, you want to leave the student thing? I got out of— Don't forget Noel Rollins."
    },
    {
      "start": 130.863,
      "end": 146.911,
      "text": " I said, don't forget when you start that to mention Doe Rollins was the causer for coming here. Excuse me, but I don't. I was discharged from Fort Hood on 25 September."
    },
    {
      "start": 147.552,
      "end": 164.191,
      "text": " But I wasn't discharged until January the 20th because I had maximum leave left from overseas. So I was over in East Texas tearing down my old family home."
    },
    {
      "start": 164.95,
      "end": 182.72,
      "text": " and building a small, comfortable house for my mother. My father passed away while I was overseas. And the Red Cross said they'd send me home if I wanted to, and I said, well, then I'll go hold a service until I get there, and I'll have to turn around and come back."
    },
    {
      "start": 182.72,
      "end": 209.095,
      "text": " Just tell them that I can't come.\" And I was over there building the house, a little house for her. And Doe Rollins was the first dean of student affairs that was selected, and he was at Luke's Grocery Store at the East Gate one afternoon buying groceries, and ran into Dr. Ed Williams, who was my department head."
    },
    {
      "start": 209.618,
      "end": 229.396,
      "text": " I sent in some rare hardwood while I was overseas and still had a piece of it on his counter, and he said, you're back, you can have it. And they were together over there, and Mr. Rollins said, Ed, I'm trying to put a staff together for the Student Affairs Department because the World War veterans are coming back."
    },
    {
      "start": 230.459,
      "end": 247.25,
      "text": " And do you know anybody that might be interested?\" And he knew that he's the only person that knew where I was. I was going back to my school in February, to my old job, and this letter."
    },
    {
      "start": 247.25,
      "end": 267.162,
      "text": " He said, I know one person that might be interested. I said, well, where is he? He said, he's in East Texas building a house for his mother. He said, well, will you give me his address so I can get in touch with him? He said, under one condition, tell me how much you're going to pay him."
    },
    {
      "start": 267.162,
      "end": 297.098,
      "text": " Said, I'll pay him $300 a month and give him a house on campus with all utilities paid for $19. So Doe contacted me over there, and it was the middle of the week, and they were playing Baylor here that weekend. He said, come over and join me for the Baylor game, and we'll talk about it. And that was in late October, and I started working for him first of November. He had only two people on his staff"
    },
    {
      "start": 298.482,
      "end": 327.153,
      "text": " And Woody Varner, who was a cadet colonel when he was a senior. Durwood T. Varner? Durwood Varner. Did you know him? Was the assistant dean. And Benny Zinn was aboard, but he was doing the veteran's work there and later would come to student affairs. And he said, we need four or five people for my staff. Fred Somebody. Huh? Fred Somebody was..."
    },
    {
      "start": 327.642,
      "end": 354.305,
      "text": " in that department? Fred Hickman. Fred Hickman. Fred Hickman was the campus security officer. And Roy Bucek was with us for a while, and Jimmy Williams was with us for a while. He was the manager of the Cowboy. Anyway, we started to work the first of November. Woody Varner. Huh? That's another one. Woody Varner. Yeah. Well, I don't know. You mentioned him. Okay."
    },
    {
      "start": 355.908,
      "end": 376.478,
      "text": " I worked in the Cadet Corps as a counselor for two years. And where did your office in those days? I was in Dormitory 9 and had so many dormitories to look after. And Cadet Corps then was at the low end."
    },
    {
      "start": 377.963,
      "end": 405.976,
      "text": " And being over there two years, they said, you being in the National Guard, I don't think it would be out of the ordinary to ask you to wear a uniform to work. I said, well, one night a week in the National Guard is enough for my uniform, because I'd been in over four years. And I said, find me something else to do. So they sent me to Prairie Hall. I stayed there 12 years."
    },
    {
      "start": 407.343,
      "end": 435.052,
      "text": " and worked with civilian students and married students. And don't regret it at all because it was an uphill pull in the cadet corps in those days. Back to this, to create this student affairs area, do you have any idea whose idea that was? I'm trying to see who was president at the time. Was it Gilchrist or Bolton or Harrington?"
    },
    {
      "start": 436.992,
      "end": 449.243,
      "text": " I don't remember who the president was. I thought it was Williams. Huh? I thought Mr. Williams, sort of. D.W. Williams? Not D.W., the one, the other Williams. Jack Williams? They had the fat wife."
    },
    {
      "start": 450.07,
      "end": 475.012,
      "text": " I don't remember who was the president, but I think it was decided that we need some type of organized effort to help the World War II veterans, because they pulled corps classes out, and they would come back as commissioned officers, and some of them non-commissioned officers, and they didn't want to go back to cadet corps. A few of them did, and they were the biggest"
    },
    {
      "start": 475.012,
      "end": 502.653,
      "text": " problems. We just had a straight cadet, and then they branched off from that and made an office for veterans' education. Taylor Wilkins, who was on my basketball squad a year behind me, was a veteran advisor, and somebody to help them with everything they needed, particularly academic"
    },
    {
      "start": 503.125,
      "end": 529.889,
      "text": " And your civilian student advising, that began when? About two years. I was in the cadet corps about two years. That would be 45, 46, 47. I moved to Prairie Hall and stayed there until I terminated my services with the Department of Student Affairs. And by this time, by 47,"
    },
    {
      "start": 530.497,
      "end": 559.319,
      "text": " the veterans are living all over the south end of the campus, aren't they? That's right. And World War II was gone, Vietnam had come in, Korean veterans had come in, and they were a different class of kittens. They didn't know one way to do something, and that's the way they wanted to do it. The World War II veterans, many of them were married,"
    },
    {
      "start": 559.792,
      "end": 587.517,
      "text": " What did their wives do? They couldn't take classes in the nine months. Did they work? Well, some of the wives worked. They had a whole project right where the parking lot is now between the television station and the back of G. Riley Way. They called it Vet Village with prefab houses. Well, you know where Vet Village is, don't you?"
    },
    {
      "start": 588.192,
      "end": 611.632,
      "text": " problems did you, as a counselor-advisor, what kind of problems did those World War II veterans have? Most of it was financial. Some of it was marital problems, because they'd been away. And just no two days alike. Now, they were mature. They'd been to the other side of the world."
    },
    {
      "start": 612.593,
      "end": 638.412,
      "text": " And they had this philosophy of the only thing to do something is the way I want to do it. That was the biggest obstacle. And we were close enough to them being in charge of their dormitory, they had to start a resignation procedure with the counselor's office."
    },
    {
      "start": 638.564,
      "end": 665.412,
      "text": " And I mentioned this one in that story in the magazine. I was in Walton Hall at the time for a short period of time, and a pre-vet student came in. In fact, he was maybe in his first or second year. He said, I've got to resign. And I said, well, is there any way we can keep him from resigning? He said, I just can't make my finances be."
    },
    {
      "start": 666.458,
      "end": 692.75,
      "text": " And he was a little older than every boy. And I had a dormitory supervisor job. We called them housemasters then. They got something else for them now, opening for $35 a month. They helped with the dormitory at night and delivered the personal mail to them. Not U.S. mail, but campus mail. And I said, well, would $35 a month help you?"
    },
    {
      "start": 692.75,
      "end": 698.977,
      "text": " He said, I could see that it would help if I had a $35 job."
    },
    {
      "start": 699.145,
      "end": 723.479,
      "text": " So I made him a housemaster. And he finished his degree in veterinary medicine. And that's the person I didn't mention by name in this article. And he's now down at, I think, Katy or Paralanta, somewhere, as a veterinarian, been in business over 20 years. But I thought he'd see it and write it, but maybe he's forgotten it."
    },
    {
      "start": 723.479,
      "end": 744.016,
      "text": " But some of them had trouble making a study schedule. For instance, I had one from Nacogdoches that was coming in with some very poor grades at midterm, so that was what we looked at first to see what his grades were."
    },
    {
      "start": 744.809,
      "end": 767.843,
      "text": " And I called him in and I said, what seemed to be your problem? He says, well, maybe I'm not studying enough and not staying here enough. And I said, well, tell me your week's routine. He said, I go home Friday evening if I don't have any classes on Saturday and come back early Monday morning or late Sunday afternoon."
    },
    {
      "start": 767.843,
      "end": 796.666,
      "text": " And I said, in other words, he said, got a girlfriend I have to see every weekend. I said, you with her on Friday night and Saturday night, Sunday night. And Monday night, whether you're in class or not, you don't get over here in time to study and you sleep in class on Monday. And we figured it out. He was only studying two nights a week. So it salvaged him."
    },
    {
      "start": 797.476,
      "end": 824.223,
      "text": " He got him straightened out on a schedule and sat down and helped him make a steady schedule, because that's something some of them had never thought of. Were you part of the group that helped create the move of freshmen out to Bryan Field? Yes, I was the dean of students representative out there. Bob Melcher was the communist officer there."
    },
    {
      "start": 824.51,
      "end": 841.081,
      "text": " Whose idea was that? I never did know. Dr. Harrington, I think, was the first person out there as an academic dean. He only stayed one year, and Cliff Randall, I believe, followed him."
    },
    {
      "start": 841.081,
      "end": 857.078,
      "text": " They had everything out there a freshman needed, and they had over a thousand, except chemistry lab, machine shop labs, and labs of any significance. And they bussed them back in here on Saturday morning."
    },
    {
      "start": 857.078,
      "end": 884.18,
      "text": " They had their own dining hall, their own health center, their own library, their own student center. And a lot of the fellas didn't like it, and the upper class on campus didn't like it, because they thought this kind of segregated them. Well, in one way, there might have been, because their situation on the campus"
    },
    {
      "start": 884.18,
      "end": 903.772,
      "text": " at that time was getting pretty rough. And I was, we were organized out there just like we were on the campus, but as a branch. Do you ever know Buford Hancock? No, sir. He's a horticulture graduate, a horticulture, retiring now. Oh, now I know. Yes, yes."
    },
    {
      "start": 904.244,
      "end": 932.763,
      "text": " He was a telephone orderly from 5 o'clock on Friday afternoon until 8 o'clock on Monday morning. All the telephone calls went to his apartment, and he worked his way through school. As you look back on the Bryan Field effort, is there anything that A&M might have done to have done that better? How do you think that"
    },
    {
      "start": 933.877,
      "end": 951.359,
      "text": " Under the circumstances, I don't believe they could have done it any better with what they had, because they had to use the old barracks and their old buildings for dining halls, and they had to use what structures were there, and they didn't have time to change it."
    },
    {
      "start": 952.186,
      "end": 981.042,
      "text": " And there were no other facilities available anywhere close, were there? That's right. The only thing that might have been improved, they might have had a little bit more dormitory supervision, because they tried to find a cadet, a freshman cadet who'd had a high school ROTC, and let him be a company commander. And they did that where they could, but they had some that were real oddballs."
    },
    {
      "start": 981.498,
      "end": 1010.236,
      "text": " During this 12 years, your service with the university ends in what year? 1973. I had a period of five years between my work with the student affairs and my separation, because I left the department five years before I retired."
    },
    {
      "start": 1011.67,
      "end": 1041.1,
      "text": " Administratively, you reported to whom? I reported to the dean of students over here on affairs that pertained to us. And who was the first dean of students that you reported to? I think Doe Rollins, or Penn Bertha might have been the student. He might have been the dean at that time. I don't remember for sure. And you were responsible, what was the scope of your responsibility?"
    },
    {
      "start": 1041.505,
      "end": 1060.777,
      "text": " anything that would pertain to supervision and control. What were the biggest headaches? Lacking supervision in the dormitory. Can you give some examples of some of the extreme problems?"
    },
    {
      "start": 1061.35,
      "end": 1088.283,
      "text": " There was too many of them in one building there, and they wasn't getting as much studies as they needed. And it depended on the study conditions that were outlined by the group leaders. They might have had a squad leader that was a raw freshman, so they didn't have the study opportunities they had. But it saved an awful lot of kids."
    },
    {
      "start": 1088.283,
      "end": 1105.748,
      "text": " I hardly ever walked across the campus at a football game when somebody stops and says, you don't remember me, but I was at the annex when you were there, and you helped me do this, they helped me do that. And so we helped an awful lot of people that might have done better."
    },
    {
      "start": 1105.748,
      "end": 1129.643,
      "text": " I think, with more administrative help in the area. It could have been an upperclassman if he had been selected and did what they wanted him to do, like our dormitory supervisors over here. But I think they were afraid if they put a cadet out there, they'd be right back where they started. And you looked over both civilian"
    },
    {
      "start": 1130.47,
      "end": 1147.227,
      "text": " Yeah, there was not many civilians. We had about, oh, probably three billion that were civilians. Had less trouble with them than did the cadet. When did it become optional for a student to drop out of the Corps after the sophomore year?"
    },
    {
      "start": 1150.417,
      "end": 1180.15,
      "text": " I don't remember. I think it was often a long time ago that they had their two years of basic and did not have to get a contract. Now, not being compulsory, I don't remember those years. See, that's one of, I think, the best things that ever happened. The Corps were going to have to clean up some of their own problems. But you only took a contract when you were a junior,"
    },
    {
      "start": 1180.15,
      "end": 1209.918,
      "text": " if you were qualified and wanted to commission. And there was a three-hour vacant spot in your curriculum to put your military sign. And now it's extra. You've got to go to summer school now to graduate in four years. Dr. Abbott came back to the campus as the chief academic officer and"
    },
    {
      "start": 1210.694,
      "end": 1236.023,
      "text": " You didn't report to him, though? Other than just things that we need to keep up with each other. Yeah, he was, I believe he was the last person out there. When I got here in 1959, Dean Hannigan either was here or soon got here. Who was dean of students before him? Ransom. Cliff Ransom was"
    },
    {
      "start": 1236.445,
      "end": 1262.973,
      "text": " in there for several years. Is that right? Cliff Ransdell. Who would later become Associate Dean of Engineering. That's right. Describe Dean Ransdell and his manner of leadership. Well, he put his self in it as if he was in the other person's place and tried to"
    },
    {
      "start": 1265.74,
      "end": 1294.968,
      "text": " tried to fulfill their objective out there. And as far as academic qualifications, don't let him know this, I don't believe he had the academic qualifications that Harrington or Abbott had, but he did a good job. This man Rutter, when he was selected to be president, did you remember him from his undergraduate days? Yes."
    },
    {
      "start": 1295.17,
      "end": 1320.398,
      "text": " He came here from John Tarleton as what they call a frog junior or something like that. He had his basic military science up there. Did you know him as an undergraduate? Yeah. You were acquainted with him? Not personally, but... Because he and Tiger and Lupo were all in the same class, I think."
    },
    {
      "start": 1321.023,
      "end": 1336.463,
      "text": " Let's don't put Lupo's stories on the tape. But one, he was in my company. Lupo was? Yeah. What time he was there."
    },
    {
      "start": 1336.936,
      "end": 1356.764,
      "text": " But he visited all the freshmen in the first week with a couple of Stillson wrenches. And he said, you pay rent on the steam radiator is due the beginning of each month. And he had a few of them disconnected."
    },
    {
      "start": 1357.557,
      "end": 1386.211,
      "text": " until Tiger found out about it. He solved that right quick. He was renting, he was telling them that he was renting the radios to them. Now, I've heard a myth that Lupo got caught with beer in his room. Well, I wouldn't be a bit surprised if the attack officer happened to be there at the right time. Alright, when Mr. Rutter got here,"
    },
    {
      "start": 1387.308,
      "end": 1415.894,
      "text": " Do you remember anything changing quickly when he takes over regarding student affairs? I don't know other than he had a lot more backing than maybe some of the other presidents gave the student affairs department. And he then brought in Dean Hannigan. How was he as dean of students? Describe him and his method. Well, if you cut this part of your tape out,"
    },
    {
      "start": 1416.383,
      "end": 1442.658,
      "text": " Go ahead and record it. That's when I, when Dean Hannigan, been here a couple years, when I left during the fire. Korean veterans or Vietnam veterans were here and they would come to the dining hall to eat the evening meal barefooted, no shirt, a pair of dirty, sweaty trunks and maybe a jockey strap."
    },
    {
      "start": 1444.126,
      "end": 1471.565,
      "text": " And occasionally, we'd go to the dining hall at noon and at the end of the meal just to be seen and eyeball the situation. And on one afternoon, I turned back about five or six of them that were not presentable to eat. And they formed a committee of about three to see the dean the next morning that I wouldn't let them eat in the dining hall without going and taking a shower."
    },
    {
      "start": 1472.662,
      "end": 1488.001,
      "text": " And so the dean was agreeable with them, and he called Benny Zinn, who was my department's supervisor, and said, tell Breezer to let them eat any way they want to as long as they don't throw chairs and tables."
    },
    {
      "start": 1488.001,
      "end": 1513.567,
      "text": " Well, at that time, they were having an ad hoc committee, and Dorsey McCrory was head of it, studying the faculty mail service. It was in bad shape and had been for years because the extension service had taken one semester, the experiment station one semester, and the university one semester, and there was no continuity, no organization, and they were behind with all the mail."
    },
    {
      "start": 1514.343,
      "end": 1529.513,
      "text": " And this ad hoc committee come up with a recommendation for staff and equipment, budget and everything, and that the dormitory, that the male supervisor have a degree."
    },
    {
      "start": 1529.513,
      "end": 1556.885,
      "text": " And I applied for the job, and the only thing I knew was what to put on a three-cent stamp on a postcard, a letter. And it was three cents, I think then. And Herb Bovard was president, chairman of the Ag Communications Department. He's, I think, retired up in Experiment Station in East Texas. Hired me for the job over"
    },
    {
      "start": 1557.897,
      "end": 1562.133,
      "text": " people who had had postal experience because of my knowledge of the campus."
    },
    {
      "start": 1562.757,
      "end": 1590.483,
      "text": " knew where all the departments were. And I got the job and stayed with them five years. And Mr. Hutter heard that I'd changed jobs, and he sent for me. I said, well, forget it. Walked down there, and I wondered what I've done now. Walked in, he closed the door, and sat down, and he said, I want to know why you left Student Affairs."
    },
    {
      "start": 1591.883,
      "end": 1616.521,
      "text": " And I told him. He beat his fist on the table and got up and walked around the table with me and sat down again. He said, I wish you'd have let me know and we'd have had a little battle on the campus and you and I had been on the same side. And I had been passed up on a job as supervisor of College View."
    },
    {
      "start": 1617.972,
      "end": 1645.31,
      "text": " They put some warrant officer in there that fiscal plants, Walter Parsons knew, in the service. And he didn't like that. I told him I'd been passed over that. He said, I wish you'd come talk to me. He said, are you satisfied with what you're doing? I said, yeah, because I can see if I do anything at all, it's going to be an improvement. And it took me about three months to get it straightened out. There was eight, there was enough"
    },
    {
      "start": 1645.748,
      "end": 1671.533,
      "text": " packages to fill this room backlog the day I walked in there. And all I had to do was get some kind of supervision and system to divide them. And in a month's time, we were taking a sack full of packages of chemistry instead of them being mixed in the pack. I went to Post Office and borrowed some racks and mail sacks for about twenty of the big departments."
    },
    {
      "start": 1671.871,
      "end": 1692.509,
      "text": " made some bins and labeled them on the other side. And except for Monday morning, we cleaned out everything twice a day. And I got lots of compliments on that and spent a very enjoyable five years down there. The only time I was ever bothered early at night."
    },
    {
      "start": 1692.509,
      "end": 1720.184,
      "text": " that a truck wouldn't start at 5 30 in the morning to go to the mail sectional center and get first last mail. We'd start first last mail and deliver it at eight o'clock. And no drowned outs, no fire in the trash cans. But that was Mr. Rudder's feeling about that. Now, Dean Hennigan, to me, as an outsider, seemed not to understand Texas A&M."
    },
    {
      "start": 1720.808,
      "end": 1745.041,
      "text": " Well, I think that's one thing, and it either had to be like West Point was or not at all. Personally, I had nothing against him. Same here. We visited with him and had a meal or something together, student affairs quite often, but I just didn't want to"
    },
    {
      "start": 1746.661,
      "end": 1776.125,
      "text": " approved something that I didn't think was right. I thought it was part of their training, and the rudder thought so too. One of my favorite Hannigan stories that I experienced personally, when the students were walking across the drill field so much, they were wearing a path across it. I was on the MSC Council, and there was a group of them, and somebody recommended that somehow it be cordoned off. So Hannigan said, put some bailing wire around all the trees"
    },
    {
      "start": 1776.513,
      "end": 1800.391,
      "text": " two or three strands all the way around the drill field. Well of course the next morning all that bailing wire was cut many, many times. And we had a meeting and he was wondering where in the world any student would have found wire cutters. And I, with a little bit of country background, suggested that perhaps they're called pliers. And he said, where would they learn how to use them?"
    },
    {
      "start": 1801.42,
      "end": 1821.282,
      "text": " That's the pair of pliers they cut to us. And where would they get them? And I said, well, if you look in any pickup, you'll find a pair. And if you ask any normal Texas kid, he will have used a lot of pliers, a lot. Or in his car, too, by the way. That's right. And he was very, very surprised."
    },
    {
      "start": 1821.535,
      "end": 1847.776,
      "text": " As you look back on those years, what were the key decisions that you now can think of that were made at A&M, whether you helped make them or not, during this 45 from U.K.? Well, I think military science being optional helped clean up the Corps. And I noticed an article in the yesterday's battalion"
    },
    {
      "start": 1847.776,
      "end": 1867.182,
      "text": " about teaching them how to eat in the dining hall. Do you read that? And that and girls being admitted, because when I was in school the only people who could go, the ladies were daughters of employees."
    },
    {
      "start": 1868.363,
      "end": 1892.782,
      "text": " So I think that's the two main things that helped our enrollment and helped the personnel and the attitude in general. And it's just a different ballgame now. And we've got lots of student organizations."
    }
  ]
}