{
  "segments": [
    {
      "start": 2.377,
      "end": 20.956,
      "text": " Because during the day, she was tired because she got up early and go into her room, and if the bottom bunk was not occupied, that's where she spent the day or the half a day. And she took up with the band first."
    },
    {
      "start": 21.412,
      "end": 49.424,
      "text": " And that happened when she was in the basement of Leggett Hall in a room they called a trunk room. That's where the two veterinarians kept her. And all the freshmen were detailed to bring food out of the dining hall and feed her. And she meant it and got to feeling pretty good. And when the band played for Riverleaf Formation,"
    },
    {
      "start": 49.863,
      "end": 77.622,
      "text": " at breakfast one morning the door was cracked wide enough for her to come out. So she did and went and joined the band. And it was a little difficult I think for her because it was tough on her ears. So she stayed with the band about three weeks and didn't have anything to do with anybody else. But from then on she was everybody's puppy. Now, I had heard the legend that she would start barking"
    },
    {
      "start": 78.196,
      "end": 105.685,
      "text": " at Morning Reveille. Is that a myth? I don't remember. She might have while the band was playing. I think it was because it was difficult for her ears. Was there any administrator who gave official approval to Reveille being in the dormitory? I guess not. The Commandant agreed with it."
    },
    {
      "start": 106.208,
      "end": 131.656,
      "text": " And she had the full run of all the dormitories after she quit the band. Right. Now, what always has surprised me is that somebody didn't try to get another dog or a cat or something. Was there ever any other? No, nothing ever on the campus except during Mr. Rutter's time he had a bulldog. I remember that one."
    },
    {
      "start": 131.757,
      "end": 158.302,
      "text": " Ranger. Ranger. And I think he's buried out there somewhere pretty close to the President's house. But Ranger did not intercede or interfere with Reveille's territory. Let me add this little anecdote about Reveille. This is soon after the MSC expansion project is completed."
    },
    {
      "start": 159.331,
      "end": 188.322,
      "text": " And I'm in the downstairs kind of snack bar having a Coke, and here come some two or three A&M cadets with revelry. And the fella in charge of the snack bar did not have an A&M background. And I hear him yell, get that dog out of here. Nobody pays any attention. And he yells out again, get that dog out of here. And again, they just keep on. Finally, he says, I done told you, get that damn dog out of here."
    },
    {
      "start": 188.862,
      "end": 215.069,
      "text": " And he's walking over to these sophomores with the dog, and he told them, and they said, sir, this ain't no dog. He said, what do you mean this ain't no dog? He said, this is Reveille. No, I had not heard that. Was it the original Reveille or the one of the college? Oh, no, this would have been 1972 or three. Oh, one of the college. Oh, yes, yes."
    },
    {
      "start": 215.069,
      "end": 240.196,
      "text": " But this guy didn't know anything about A&M tradition and he had no idea what this was. What did he do then? Oh, he backed away. I said, sir, this dog goes anywhere. Well, she did and she made a lot of friends and was friendly with everybody. Was there ever, with that first dog,"
    },
    {
      "start": 240.382,
      "end": 263.45,
      "text": " Was there any effort by somebody to, quote, train her, or did she just kind of come by her behavior naturally? She'd come by nature to go with formations and do what everybody else did. If there was anybody that ever trained her,"
    },
    {
      "start": 263.686,
      "end": 292.913,
      "text": " I was not aware of it. But she was very friendly and was everybody's friend. None of the Brewer bred dogs they've had since then, I don't think, have ever been as smart as she was. And she was, there'd been some veterinarians made research trying to figure out what her breed was, and they come to one conclusion, it was a Heinz 57."
    },
    {
      "start": 293.707,
      "end": 322.09,
      "text": " Did anybody ever have any information about where she might have come from, whose dog it was? No. They thought possibly that somebody dropped her out of a car to get rid of her. That's when she got run over. How was it decided who would take the first Reveille home the first summer? I do not remember that. She might have just stayed on the campus."
    },
    {
      "start": 323.71,
      "end": 344.618,
      "text": " But it was your outfit? No, it wasn't anybody. There was no outfit responsible for it. Well, no, but who, in whose room, wasn't there somebody that kind of took care of her? No, she just retired wherever she decided at night."
    },
    {
      "start": 344.804,
      "end": 366.067,
      "text": " It would be on somebody's bottom bunk if it was an empty bunk somewhere. But that's the only way you could get out of your bunk, and the best thing to go find the empty bunk yourself and leave her alone. By and large, did she move from room to room, bunk to bunk? Oh, just never know where she'd be at night."
    },
    {
      "start": 366.657,
      "end": 395.446,
      "text": " Let's see, in your outfit, what was it? G, infantry. Did it have a nickname? Huh. Y'all didn't have a, I thought every outfit had a nickname. If it did, I don't remember. We had two regiments, A, B, C, and D, and E, F, G, and H. Describe a typical class day in terms of what did you wear and what kind of behavior was expected in the classroom."
    },
    {
      "start": 396.273,
      "end": 408.203,
      "text": " Well, in the classroom, I don't know of a professor that did not demand perfect behavior, and everybody wore their uniforms."
    },
    {
      "start": 408.608,
      "end": 437.988,
      "text": " What uniform were you all wearing in those days? It was khaki in the summer and wools in the winter. But the professors were very firm about their conduct in the class. Now, there were a few of them would vary from it, but not much. But everybody knew who would accept this and who wouldn't. Who were, as you think back,"
    },
    {
      "start": 438.612,
      "end": 464.465,
      "text": " on your student days, particularly your freshman, who were some faculty members that had an effect on you and your future life? I don't remember any in particular, probably, unless it was John Paul Abbott, who died a few years ago. He had the reputation of being one of the best freshman English teachers we had. And Dr."
    },
    {
      "start": 465.342,
      "end": 491.566,
      "text": " whose son's an attorney in Bryan now, was another favorite. What were their nicknames, according to the students? Well, Cofer was Dusty, but I don't think John Paul had a nickname. Dusty Cofer was all he's ever known. I thought there was a second word in his nickname. I thought it was D.B. as in Dusty Butt. Well, it might have been. Might not have been to his face."
    },
    {
      "start": 492.578,
      "end": 520.355,
      "text": " Didn't every faculty, almost every faculty member have a nickname? No, not every one of them, but quite a few of them. We had a history professor that you could hear clear across the campus screaming Al Nelson. And that's the only one I recall. When did you get your nickname? I got it playing basketball. Here? Here. And the story was that"
    },
    {
      "start": 522.903,
      "end": 548.62,
      "text": " If somebody wasn't doing a good job on defense, I passed them so fast they felt a breeze. And then after I got too old to play basketball, I never quit talking. But basketball is a different story. The freshman coach and the varsity coach meant an awful lot to my life, too. Who were they?"
    },
    {
      "start": 549.262,
      "end": 574.118,
      "text": " Clepto Holmes, who was a football assistant, I think, taught physical education. And when we signed up for physical education, you had your choice of sports. Well, all I knew was basketball and track, and I didn't want to play with track during the winter on the outside, so I signed up for basketball and went to his basketball class."
    },
    {
      "start": 575.975,
      "end": 605.05,
      "text": " And just before he started working out for freshman basketball, they had a freshman team that was not eligible for the varsity. And he stopped me at the end of a PE class one day and busied a little bit and said, where did you play high school basketball? And I told him and he said, how long? I said, well, I've had a basketball in my hand since it was big enough to throw it through a hook on the side of a barn."
    },
    {
      "start": 606.164,
      "end": 633.299,
      "text": " And he said, well, I've watched you here in P.E., and I think you've got enough ability that I'd like to have you on my freshman squad, and we're going to start working out Monday at a certain time. And I said, well, is it going to conflict with my P.E. class? And he said, no, you come out from freshman basketball, as long as you stay on the squad, you don't have to come to my P.E. class."
    },
    {
      "start": 634.328,
      "end": 646.411,
      "text": " So that was my beginning of basketball, and we played ten games against local schools."
    },
    {
      "start": 646.732,
      "end": 668.247,
      "text": " got a basketball enumera, which was a gray sweater with a 35 in a circle. And then the basketball coach expected everybody that was on the face team to join him next year, which I did. And he was Coach John Reed."
    },
    {
      "start": 668.247,
      "end": 696.31,
      "text": " was in about his second or third year here. I believe he came in 29 and resigned at the end of my senior year. He played at North Texas and had been to Baylor. And the squad was small. We only had seven lettermen my sophomore year. And I was fortunate enough to be one of those two sophomores."
    },
    {
      "start": 697.492,
      "end": 703.769,
      "text": " And we didn't have my three years on the varsity, we did not have but one scholarship."
    },
    {
      "start": 705.44,
      "end": 734.752,
      "text": " A boy named Joe Merker was about 6'3 or 6'4 from Bryan High School and made Allstate the year before in his senior year. And everybody in the conference wanted him as a player. So they gave him a scholarship to stay at home to keep having to play against him. And that's the only scholarship that was given. The rest of them were walk-ons. We had two or three guys that would come help us in basketball."
    },
    {
      "start": 734.752,
      "end": 758.933,
      "text": " from the football squad after Thanksgiving, and one of those was General Ray Murray, who was a two-star Marine general. Our correspondent was still living in Oceanside, California. Now, you played what position in basketball? Center and forward. And you're what height then? Six-two. Six-two. And were there any"
    },
    {
      "start": 759.828,
      "end": 779.774,
      "text": " much taller players in the conference? Oh, yeah, quite a few players. We had one player of our own that was 6'5\", but his shoulders were narrow and I could not reach him on the wall because of the length of my arm. And I was a substitute center during Joe Mercer's day. He was one class ahead of me."
    },
    {
      "start": 780.989,
      "end": 806.656,
      "text": " And I might have not made the squad that first year if it had not been for him getting the flu. We took a five-day trip during the Christmas holidays, played independent and AAU teams, and he'd give us about three days to go home Christmas and come back after Christmas and get ready for the first game, first weekend in January for the conference."
    },
    {
      "start": 806.656,
      "end": 834.162,
      "text": " And he'd already posted the list on the bulletin board of the people who were going to make the five-day trip my sophomore year. And after practice, he called me to the office. In his slow, bold language, he said, Breezy, I don't think you're qualified to go on this trip."
    },
    {
      "start": 835.343,
      "end": 858.31,
      "text": " But Joe has had the flu, and I believe I better take it. So where did you all go? First night we went to Stephen F. Austin. No, first night we went to Beaumont and played a town team. Second night we went to play Stephen F. Austin with a guy named Bob Shelton who was a great friend of mine."
    },
    {
      "start": 859.542,
      "end": 888.787,
      "text": " And Joe wasn't feeling too well, and so he started me at center. And started me at center. And second quarter, he put Joe to play until he got tired, and I finished up for him. So we had about a quarter and a half each half during that game, because he just didn't have the strength."
    },
    {
      "start": 888.787,
      "end": 907.231,
      "text": " and they had an all-conference center and I outscored him and kept him under control my part of the game and we went on to East Texas and played an independent oil team called Hunt Oilers and they had"
    },
    {
      "start": 907.231,
      "end": 936.239,
      "text": " two or three players from the Athens High School National Championship. And then I think we played Sunday. We played four nights in a row. And so we come back home, and he said, after all of this, I'm glad I decided to take you. So I made a letter on my sophomore year. All right, so your sophomore year, then you're on the varsity track."
    },
    {
      "start": 937.083,
      "end": 960.522,
      "text": " Yeah, varsity track, but nothing but high jump after basketball was over. Describe Coach Anderson as a person, as a human being. Well, there's never been a more dedicated coach in my lifetime as far as looking after his athletes and training them and having the desire for them to"
    },
    {
      "start": 961.484,
      "end": 990.391,
      "text": " do their very best from the time come. I just thought he did awful well, and he did. He helped me change my form after basketball my freshman year. We didn't have many six-foot jumpers, but I was one of a few six-foot jumpers that we had. But we never could do very well in dual meets and conference meets because Texas"
    },
    {
      "start": 990.391,
      "end": 1018.842,
      "text": " Usually carried five people that were better than six-foot jumpers. And he would not start his starting lineup. He wouldn't, the track coach, Littlefield, would not decide who was going to enter until he watched the warm-up. Then he'd designate the three. And I had my last session with him when I was a senior."
    },
    {
      "start": 1020.344,
      "end": 1049.437,
      "text": " in the conference track meet. You had to have 11 points in dual meets to get a letter. Well, I had nine, and went to the conference meet in the Orenby Stadium in Dallas, and there was about 20 some odd people. Started out in the high jump, got to one certain height, I don't remember, probably a little less than six feet, and then wheeled them down to six people."
    },
    {
      "start": 1051.158,
      "end": 1075.728,
      "text": " And you had three trials, three opportunities to make it. And for 18 consecutive tries, all six of them knocked it three down. So we had six people tied for 11 points. So you divide that and got one point and six tenths. Five, six."
    },
    {
      "start": 1075.728,
      "end": 1097.395,
      "text": " And that gave me a letter my senior year. Otherwise, I'd never beat those Texas guys because they were better jumpers. But it was a cool day, and they just weren't at their best. And Colonel Landy did a lot of things to help you train when you were away from the track."
    },
    {
      "start": 1098.509,
      "end": 1112.026,
      "text": " What were some of his rules? Well, he didn't have a rule. He just had a suggestion that your body needs more water than most people give it, so you drink a pint of water before you go to breakfast."
    },
    {
      "start": 1112.566,
      "end": 1141.118,
      "text": " and a pint of water when you come back. I had a pint container in my laboratory. And I did it and said, it'll keep you regular and it'll help your digestive system and this, that, and the other. And I ended up top working some pecan trees for him before he died in his yard, as well as some for his son, who was an ophthalmologist. I've interviewed Rusty. Rusty."
    },
    {
      "start": 1141.793,
      "end": 1160.272,
      "text": " In fact, I taught Rusty in two seasons to graft himself. And that's an interesting story, but it doesn't have anything to do with this. I worked with him on one full afternoon."
    },
    {
      "start": 1160.626,
      "end": 1172.928,
      "text": " And after about four or five trees, I put the apron on his neck and said, now you get the next one. He said, Breezy, do one more because I haven't been paying attention."
    },
    {
      "start": 1174.885,
      "end": 1203.792,
      "text": " So I did one more and went through about 13 steps with him. And he did it from his own, from then on. In fact, the last two years he worked, he didn't even invite me to go with him. But he was a personal friend. In fact, before he retired, he gave me a longhorn heifer that I still have. All right, so you were a varsity track."
    },
    {
      "start": 1204.062,
      "end": 1233.357,
      "text": " and basketball, three years each. And the only financial benefit from that, in terms of a scholarship-like, was your dining hall job. And you graduated in how many, in four years, I'll tell you? In four years. I got a little behind some of my work my sophomore year because I wanted to be a mechanical engineer because I had a lot of mechanical ability."
    },
    {
      "start": 1234.032,
      "end": 1259.412,
      "text": " But I did not have the math background to pass calculus. So Dean Bolton was the dean of engineering, and he called me in after the first semester. And he had a son also that was in my class. And he said, you're doing well in athletics, but you're not doing very well in calculus. And if you're going to continue your athletics,"
    },
    {
      "start": 1260.627,
      "end": 1281.35,
      "text": " I believe you ought to change courses and get out of engineering, because it required sophomore two classes of calculus. And I never could understand why, unless a professor got, because I had, in freshman math, I had two As."
    },
    {
      "start": 1282.362,
      "end": 1299.423,
      "text": " But I could not pass calculus, so I changed to industrial education and ended up as a teacher and a coach. But he said, you got to side on one. And I had to go to summer school one summer to make up"
    },
    {
      "start": 1300.064,
      "end": 1328.87,
      "text": " for what I was behind. And that was after camp, I believe, my junior year, my junior ROTC camp. And it was during that summer semester when I met my bride. We'll talk about that later. But both of the men, Klepto and John Reed and Frank Anderson, have meant an awful lot in my life."
    },
    {
      "start": 1329.899,
      "end": 1349.879,
      "text": " So that you didn't have any classes with them, but in fact they were teachers. That's right. Teachers in a lot of different ways. Let's see, who were some other, in those four years, who were some other teachers, advisors, that were, as you look back, were important to you?"
    },
    {
      "start": 1350.132,
      "end": 1372.863,
      "text": " Well, there was one gentleman I thought an awful lot of, his widow still lives here, Dave Fleming. He taught elementary woodwork, advanced woodwork, and pattern making, and had all three of the courses under him. In fact, I have a few pieces of furniture scattered around"
    },
    {
      "start": 1373.285,
      "end": 1400.538,
      "text": " that I made in his class. And he was a very, very outstanding professor. And I had an awful good professor in 309 and 310 ME Machine Shop, Walter Downard, that had a lot of industry experience but didn't even have a degree. And then there was John Abbott,"
    },
    {
      "start": 1401.871,
      "end": 1429.377,
      "text": " Offhand, I don't recall many others. Who did you call? My military science instructors were all very interesting, particularly my junior year. We had a Colonel Alfonte who retired at Camp Creek that was my junior military science teacher. And he had no time in his career did he ever keep a class longer than 30 minutes."
    },
    {
      "start": 1431.014,
      "end": 1444.413,
      "text": " He got his lesson plan covered and covered what he wanted to. And he never missed a day's basketball practice before or after. And one day he come."
    },
    {
      "start": 1444.987,
      "end": 1473.91,
      "text": " stopped me at the end of a class and said, I need to visit with you about something. And he gave me a piece of chalk and he said, diagram that new play you all put on yesterday afternoon. And said, I didn't quite understand it. And I'm going to see if you use it the next game. And he was a very, very interesting basketball fan. Colonel Delamater was my senior advisor and he had a son that"
    },
    {
      "start": 1473.91,
      "end": 1498.312,
      "text": " Followed them in the military here. I don't remember who my freshman was. Captain Lyons was my sophomore. But they were here for a different purpose. If you needed advice, to whom did you turn? If you needed somebody to help you understand something, a personal matter, who would you turn to?"
    },
    {
      "start": 1501.687,
      "end": 1525.193,
      "text": " I don't know. To look back on it, I believe I would talk to any one of my current coaches. Because they knew about our welfare was very important. In those days, the YMCA was an important activity center. What kinds of activities at the YMCA did you attend?"
    },
    {
      "start": 1525.413,
      "end": 1552.345,
      "text": " Just sometimes some of the socials or religious services, some kind like that. Mr. Cashin was the first advisor at YMCA, and then Gordon Gay. Gordon was superintendent of Sunday school at Methodist Church for 25, 30 years, and they had a real good program."
    },
    {
      "start": 1552.801,
      "end": 1555.703,
      "text": " Did you go to any religious activities as a student?"
    },
    {
      "start": 1556.277,
      "end": 1583.648,
      "text": " Well, I went to what's now the Wesley Foundation students at A&M United Methodist Church, and so did my brother. He was on the, I think they called it the Wesley Foundation cabinet. And the day they took a picture of my senior class group, for some reason I was absent. I wasn't in the picture."
    },
    {
      "start": 1584.644,
      "end": 1613.753,
      "text": " But Spike White, who owns these eight camps in Bronson, Missouri, is in the picture. And I sent him one of those 50-year church books not too long ago with his face circled. And he wrote me back and said, I sure do appreciate that and how much they owe you. And I have my answer to this letter. But that 50-year book was written by Mr. Bryson, who's one of the greatest people who ever put his foot on a camp."
    },
    {
      "start": 1614.209,
      "end": 1632.215,
      "text": " Describe the A&M Methodist Church physical facility at that time. Well, our beginning was in, and I think when I left here, we were still in that wooden tabernacle."
    },
    {
      "start": 1632.383,
      "end": 1647.385,
      "text": " Then we were gone 10 years and come back and they were building the sanctuary. So the wooden tabernacle was right where the sanctuary is now? No, it was between the sanctuary and the classroom."
    },
    {
      "start": 1647.385,
      "end": 1673.356,
      "text": " They had a sanctuary, and then they built a classroom behind it, and then moved the old tabernacle and joined the two buildings. Because we were here, we come back in 45, we left in 35, come back in 45, and we're in on the groundbreaking of the new sanctuary."
    },
    {
      "start": 1673.356,
      "end": 1696.745,
      "text": " And you had a good picture of that dedication in the 50-year book. But that was the first year we were back. Describe, during your undergraduate days, describe what was at Northgate. The only thing I remember to Northgate was Luke's Grocery Store."
    },
    {
      "start": 1698.162,
      "end": 1726.647,
      "text": " which is right next to Lou Potts now, and Northgate Barbershop. That's all I remember. There was no movie theater? The Shulman Campus Theater wasn't there yet? I don't believe it was. What else went on at the YMCA? I think there was a tailor shop down there. I forget now the name of it. Ludicare, I believe. What else was there? What other events happened at the YMCA?"
    },
    {
      "start": 1729.094,
      "end": 1753.563,
      "text": " I don't recall. They had an open ear for anybody that wanted to talk about their religious problems and had certain activities. Was there a religious emphasis week then? I don't believe so. There might have been. If there do, I don't remember."
    },
    {
      "start": 1754.255,
      "end": 1779.179,
      "text": " Was it common for your classmates to go to a church religious activity on the weekend? Some of them. Never been to one, never has, and probably never will, and some whatever weekend. Let's discuss in current definition the word diversity. What diversity was there in the student body then? Did you know some boys that were Catholics?"
    },
    {
      "start": 1780.141,
      "end": 1805.588,
      "text": " Yeah, unless you just accidentally found out, sometimes you never did know what the religion choice was. Were there some Jewish boys here? Yeah, we had a few Jewish boys. How were they treated? Same as all the rest of them, as far as I recall. That's the answer I thought you would give."
    },
    {
      "start": 1806.01,
      "end": 1828.673,
      "text": " Were there any international students? Yes. The international students during the time I was here lived in what we call in PG, postgraduate hall, which is a wooden building behind where Walton is now. And they were all housed together. They wore khaki uniforms during the"
    },
    {
      "start": 1830.428,
      "end": 1847.725,
      "text": " warm days and the wool uniform, just like a regular cadet, had AMC on one side and an E&M for non-military on the other side, and they gathered as a group."
    },
    {
      "start": 1847.725,
      "end": 1874.928,
      "text": " on the side of the street by the Aggieland Inn, and they went to the dining hall and ate after everybody else had gone in. That was all international students. I don't recall any of them living off campus. Do you have any recollection of what part of the world they were from, primarily? No, never did have an opportunity to be very close to any of them."
    },
    {
      "start": 1875.333,
      "end": 1882.218,
      "text": " might be having one in class next to you but i don't remember where they were from i didn't have"
    }
  ]
}